app/controllers/products_controller.rb

  def create
    Product.create(product_params)
---
INSERT INTO "products" ("name", "price", "created_at", "updated_at", "inventory", "description") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Test"], ["price", 3], ["created_at", "2020-04-09 23:37:23.461133"], ["updated_at", "2020-04-09 23:37:23.461133"], ["inventory", 12], ["description", "This is a great thing"]]